app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$/GimToOQYqamo9zn.GkQ/uW/jurnRAKy7gN9KR1ofY9UlsAhPs8E6"], ["updated_at", "2018-04-18 12:31:52.966608"], ["id", 226]]