app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "users"

  def update
    set_user
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "kingofkingshaman@yahoo.com"], ["password_digest", "$2a$10$QKxA0k76ovdKgzsLOH01KeNH/3/ZjSfkhxaaKZVxdbIiYx0JdsOQe"], ["updated_at", "2018-04-13 11:56:44.203546"], ["id", 1]]

  def destroy
    set_user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]